week2/day5/load_testing/stack1_apache_bench.txt
================================================================
  Load Test Results: Stack 1
  Date: 2026-03-02 14:22:48
  Target: https://stack1.devops.local/api/users
================================================================

=== Apache Bench: c=50 n=500  (2026-03-02 14:22:48) ===
URL: https://stack1.devops.local/health
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking stack1.devops.local (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        nginx
Server Hostname:        stack1.devops.local
Server Port:            443
SSL/TLS Protocol:       TLSv1.3,TLS_AES_256_GCM_SHA384,2048,256
Server Temp Key:        X25519 253 bits
TLS Server Name:        stack1.devops.local

Document Path:          /health
Document Length:        32 bytes

Concurrency Level:      50
Time taken for tests:   0.122 seconds
Complete requests:      500
Failed requests:        0
Keep-Alive requests:    500
Total transferred:      109500 bytes
HTML transferred:       16000 bytes
Requests per second:    4107.42 [#/sec] (mean)
Time per request:       12.173 [ms] (mean)
Time per request:       0.243 [ms] (mean, across all concurrent requests)
Transfer rate:          878.44 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   6.8      0      35
Processing:     0    4  12.3      0      43
Waiting:        0    4  12.3      0      42
Total:          0    6  18.8      0      76

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%     46
  95%     63
  98%     70
  99%     73
 100%     76 (longest request)