week2/day5/load_testing/stack1_wrk.txt
================================================================
  Load Test Results: Stack 1
  Date: 2026-03-02 14:22:48
  Target: https://stack1.devops.local/api/users
================================================================

=== wrk: t=4 c=50 d=10s  (2026-03-02 14:22:58) ===
URL: https://stack1.devops.local/health
Running 10s test @ https://stack1.devops.local/health
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   222.07us    0.92ms  57.43ms   96.70%
    Req/Sec    73.13k    15.72k  123.87k    79.75%
  Latency Distribution
     50%   95.00us
     75%  158.00us
     90%  321.00us
     99%    2.10ms
  2909757 requests in 10.00s, 607.70MB read
Requests/sec: 290841.36
Transfer/sec:     60.74MB